CHN-HYH/esp32-26-h/esp32Board_wifi/main/src/app_myhttpd.cpp
// Copyright 2015-2016 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

#include "app_myhttpd.hpp"

#include <list>
#include "esp_heap_caps.h"
#include "esp_http_server.h"
#include "esp_jpeg_enc.h"
#include "lwip/sockets.h"
#include "img_converters.h"
#include "fb_gfx.h"
#include "app_mymdns.h"
#include "sdkconfig.h"

#include "yahboom_camera.h"
#include "yahboom_performance.h"
#include "yahboom_jpeg_stream.h"
#include "esp_timer.h"

#if defined(ARDUINO_ARCH_ESP32) && defined(CONFIG_ARDUHAL_ESP_LOG)
#include "esp32-hal-log.h"
#define TAG ""
#else
#include "esp_log.h"
static const char *TAG = "camera_httpd";
#endif

static QueueHandle_t xQueueFrameI = NULL;
static QueueHandle_t xQueueFrameO = NULL;
static bool gReturnFB = true;

static int8_t detection_enabled = 0;
static int8_t recognition_enabled = 0;
static int8_t is_enrolling = 0;

typedef struct
{
    httpd_req_t *req;
    size_t len;
} jpg_chunking_t;

#define PART_BOUNDARY "123456789000000000000987654321"
#define STREAM_JPEG_QUALITY 60
#define STREAM_JPEG_BUFFER_SIZE (128 * 1024)
static const char *_STREAM_CONTENT_TYPE = "multipart/x-mixed-replace;boundary=" PART_BOUNDARY;
static const char *_STREAM_BOUNDARY = "\r\n--" PART_BOUNDARY "\r\n";
static const char *_STREAM_PART = "Content-Type: image/jpeg\r\nContent-Length: %u\r\nX-Timestamp: %lld.%06lld\r\n\r\n";

httpd_handle_t stream_httpd = NULL;
httpd_handle_t camera_httpd = NULL;
httpd_handle_t webserver = NULL;

typedef struct
{
    jpeg_enc_handle_t handle;
    uint8_t *output;
} stream_jpeg_encoder_t;

static bool stream_jpeg_encoder_init(stream_jpeg_encoder_t *encoder)
{
    jpeg_enc_config_t config = DEFAULT_JPEG_ENC_CONFIG();
    config.width = 320;
    config.height = 240;
    config.src_type = JPEG_PIXEL_FORMAT_YCbYCr;
    config.subsampling = JPEG_SUBSAMPLE_420;
    config.quality = STREAM_JPEG_QUALITY;
    config.rotate = JPEG_ROTATE_0D;
    config.task_enable = false;

    encoder->handle = NULL;
    encoder->output = static_cast<uint8_t *>(
        heap_caps_malloc(STREAM_JPEG_BUFFER_SIZE, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT));
    if (!encoder->output)
    {
        ESP_LOGE(TAG, "Fast JPEG output buffer allocation failed");
        return false;
    }

    jpeg_error_t ret = jpeg_enc_open(&config, &encoder->handle);
    if (ret != JPEG_ERR_OK)
    {
        ESP_LOGE(TAG, "Fast JPEG encoder initialization failed: %d", ret);
        free(encoder->output);
        encoder->output = NULL;
        return false;
    }

    ESP_LOGI(TAG, "Fast JPEG encoder ready: 320x240 YUV422, quality %d", STREAM_JPEG_QUALITY);
    return true;
}

static void stream_jpeg_encoder_deinit(stream_jpeg_encoder_t *encoder)
{
    if (encoder->handle)
    {
        jpeg_enc_close(encoder->handle);
        encoder->handle = NULL;
    }
    free(encoder->output);
    encoder->output = NULL;
}

static bool stream_jpeg_encode(stream_jpeg_encoder_t *encoder, const camera_fb_t *frame,
                               uint8_t **jpg_buf, size_t *jpg_len)
{
    if (!encoder->handle || !encoder->output || frame->format != PIXFORMAT_YUV422 ||
        frame->width != 320 || frame->height != 240 ||
        (reinterpret_cast<uintptr_t>(frame->buf) & 0x0f) != 0)
    {
        return false;
    }

    int encoded_size = 0;
    jpeg_error_t ret = jpeg_enc_process(encoder->handle, frame->buf, frame->len,
                                        encoder->output, STREAM_JPEG_BUFFER_SIZE,
                                        &encoded_size);
    if (ret != JPEG_ERR_OK || encoded_size <= 0)
    {
        ESP_LOGE(TAG, "Fast JPEG compression failed: %d", ret);
        return false;
    }

    *jpg_buf = encoder->output;
    *jpg_len = static_cast<size_t>(encoded_size);
    return true;
}

static size_t jpg_encode_stream(void *arg, size_t index, const void *data, size_t len)
{
    jpg_chunking_t *j = (jpg_chunking_t *)arg;
    if (!index)
    {
        j->len = 0;
    }
    if (httpd_resp_send_chunk(j->req, (const char *)data, len) != ESP_OK)
    {
        return 0;
    }
    j->len += len;
    return len;
}

static esp_err_t capture_handler(httpd_req_t *req)
{
    camera_fb_t *frame = NULL;
    esp_err_t res = ESP_OK;

    if (xQueueReceive(xQueueFrameI, &frame, portMAX_DELAY))
    {
        httpd_resp_set_type(req, "image/jpeg");
        httpd_resp_set_hdr(req, "Content-Disposition", "inline; filename=capture.jpg");
        httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");

        char ts[32];
        snprintf(ts, 32, "%lld.%06ld", frame->timestamp.tv_sec, frame->timestamp.tv_usec);
        httpd_resp_set_hdr(req, "X-Timestamp", (const char *)ts);

        // size_t fb_len = 0;
        if (frame->format == PIXFORMAT_JPEG)
        {
                // fb_len = frame->len;
            res = httpd_resp_send(req, (const char *)frame->buf, frame->len);
        }
        else
        {
            jpg_chunking_t jchunk = {req, 0};
            res = frame2jpg_cb(frame, 80, jpg_encode_stream, &jchunk) ? ESP_OK : ESP_FAIL;
            httpd_resp_send_chunk(req, NULL, 0);
            // fb_len = jchunk.len;
        }

        if (xQueueFrameO)
        {
            xQueueSend(xQueueFrameO, &frame, portMAX_DELAY);
        }
        else if (gReturnFB)
        {
            esp_camera_fb_return(frame);
        }
        else
        {
            free(frame);
        }
    }
    else
    {
        ESP_LOGE(TAG, "Camera capture failed");
        httpd_resp_send_500(req);
        return ESP_FAIL;
    }

    return res;
}

static esp_err_t capture_handler_v2(httpd_req_t *req)
{
    camera_fb_t *frame = NULL;
    esp_err_t res = ESP_OK;

    yahboom_capture_start();
    if (!yahboom_capture_get_frame(&frame, portMAX_DELAY))
    {
        yahboom_capture_stop();
        ESP_LOGE(TAG, "Camera capture failed");
        httpd_resp_send_500(req);
        return ESP_FAIL;
    }

